Tekla.Structures.Drawing.CustomLineTypeCatalog
The CustomLineTypeCatalog provides accessors to fetch the possible custom line types of drawing objects.

Tekla.Structures.Drawing.CustomLineTypeCatalog.Get(System.Int32)
Gets the CustomLineType with the specified ID.
CustomLineTypeId: The ID of the CustomLineType to fetch.
Returns: The requested CustomLineType or null if not found.

Tekla.Structures.Drawing.CustomLineTypeCatalog.Get(System.String)
Gets the CustomLineType with the specified Name.
Name: The Name of the CustomLineType to fetch.
Returns: The requested CustomLineType or null if not found.

Tekla.Structures.Drawing.CustomLineTypeCatalog.Get
Gets all the available CustomLineType's.
Returns: List of CustomLineType's.